dataset_gen/NS_datasets/LDC/LDC_irreg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    movingWall
    {
        type            fixedValue;
        inGroups        1(fixedValue);
        nFaces          128;
        startFace       24192;
        value           uniform ( 1 0 0 );
        faces           ( ( 18 19 23 22 ) ( 27 18 22 31 ) ( 26 27 31 30 ) );
    }
    fixedWalls
    {
        type            noSlip;
        nFaces          384;
        startFace       24320;
        faces           ( ( 0 4 7 3 ) ( 3 7 20 16 ) ( 16 20 23 19 ) ( 9 13 14 10 ) ( 10 14 29 25 ) ( 25 29 30 26 ) ( 0 1 5 4 ) ( 1 8 12 5 ) ( 8 9 13 12 ) );
    }
    holeWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          256;
        startFace       24704;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24576;
        startFace       24960;
    }
)

// ************************************************************************* //
