dataset_gen/NS_datasets/LDC/LDC_irreg/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type zeroGradient;  // Pressure is free to adjust
    }

    fixedWalls
    {
        type zeroGradient;  // Standard for no-slip walls
    }

    holeWalls
    {
        type zeroGradient;  // No specific pressure condition inside hole
    }

    frontAndBack
    {
        type empty;  // 2D simulation
    }
}


// ************************************************************************* //
