dataset_gen/NS_datasets/LDC/LDC_irreg/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
12288
(
(0.0078125 0.0078125 0.1)
(0.0234375 0.0078125 0.1)
(0.0390625 0.0078125 0.1)
(0.0546875 0.0078125 0.1)
(0.0703125 0.0078125 0.1)
(0.0859375 0.0078125 0.1)
(0.101562 0.0078125 0.1)
(0.117188 0.0078125 0.1)
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0078125 2 0.1)
(0.0234375 2 0.1)
(0.0390625 2 0.1)
(0.0546875 2 0.1)
(0.0703125 2 0.1)
(0.0859375 2 0.1)
(0.101562 2 0.1)
(0.117188 2 0.1)
...
)
;
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
384
(
(0 0.0078125 0.1)
(0 0.0234375 0.1)
(0 0.0390625 0.1)
(0 0.0546875 0.1)
(0 0.0703125 0.1)
(0 0.0859375 0.1)
(0 0.101562 0.1)
(0 0.117188 0.1)
...
)
;
    }
    holeWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
256
(
(0.5 0.507812 0.1)
(0.5 0.523438 0.1)
(0.5 0.539062 0.1)
(0.5 0.554687 0.1)
(0.5 0.570312 0.1)
(0.5 0.585938 0.1)
(0.5 0.601562 0.1)
(0.5 0.617188 0.1)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
