dataset_gen/NS_datasets/LDC/LDC_irreg/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12288
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.101562
0.117188
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.101562
0.117188
...
)
;
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
384
(
0
0
0
0
0
0
0
0
...
)
;
    }
    holeWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
